<!DOCTYPE html>
<html>
    <head>
        <meta charset="UTF-8">
        <meta lang="en">
        <title>Задачи с цикли</title>
    </head>
    <body>
    <br>
<h3>1. Напишете for цикъл, който извежда числа от 1 до 10, разделени с тире, като преди 1 и след 10 не трябва да има тире</h3>
        <br>
        <?php
    //Изваждане на числа от 1 до 10 
    for( $i=1; $i<=10; $i++ ){
    echo $i;
    //Проверяваме дали i е различно от 10
    if ($i != 10) {
        echo "-";
            }
        }  
        ?>
        <br>
        <hr>
<h3>2. Напишете php програмка, която извежда сумата на числата от 0 до 30. Използвайте for цикъл и си припомнете математическите оператори</h3>
        <br>
        <?php
        //Изнежда сумата на чилата от 1 до 30
        //Променлива със която да запазим сумата
        $sum = 0;
        for ($i = 0; $i <= 30 ; $i++) {
            $sum = $sum + $i;
}
            echo $sum;
        ?>     
        
        <br>
        <hr>
<h3>3. Напишете php програмка, която извежда факториела на  5, 8 и 10. (Факториел на число е произведението на всички цели числа от 1 до него, включително. Пример: факториел 5 е равен на 1 * 2 * 3 * 4 * 5.)</h3>
        <br>
          <?php
        //Умножаваме числата от 1 до 5/8/10
        //Променлива със която да запазим произведението

    $fac = 1;
    for ($i = 1; $i <= 5 ; $i++) {
        $fac = $fac * $i;
    }
    echo "5! = " .$fac;  
    echo ("<br>");  
    //До 5
    
   
    $fac = 1;              
    for ($i = 1; $i <= 8 ; $i++) {
        $fac = $fac * $i;
    }
    echo "8! = ". $fac;    
    echo ("<br>"); 
    //До 8
          
    
    $fac = 1;
    for ($i = 1; $i <= 10 ; $i++) {
        $fac = $fac * $i;
    }
    echo "10! = " . $fac;    
    //До 10   
    
    
            ?>      
      <br>
      <hr>
<h3>4. Напишете вложени for цикли, които извеждат следното:</h3>
      <br>
         <?php
         for ($i = 1; $i <= 5; $i++) {
         for ($a = 1; $a <= $i; $a++) {
         echo "*"; 
         }
         echo ("<br>");
              // Увеличаване до 5
         }
         echo "<br>";
            ?>
      <br>
      <hr>
<h3>5. Напишете вложени for цикли, които извеждат следното:</h3>
      <br>
        <?php
         for ($i = 1; $i <= 5; $i++) {
         for ($a = 1; $a <= $i; $a++) {  
         echo "*"; 
         }
         echo ("<br>");
             // Увеличаване до 5
         }
         for ($i = 5; $i >=1; $i--) {
         for ($a = 1; $a <= $i; $a++) {  
         echo "*"; 
         }
         echo ("<br>");
             // Намаляне до 1
         }
      ?>
      <br>
      <hr>
<h3>6/7. Напишете цикли, които извеждат "триъгълници на Флойд" с 5, 10 и 21 реда. Накратко казано, това са ляво подравнени правоъгълни триъгълници от редове с цели числа, където всеки ред започва с поредното число и съдържа с едно число повече от предния ред.</h3>
      <hr>
      <?php
      $end = "<h2>Последната задача я прескачам за сега</h2>";{
      echo "$end"; {
      }
      }
      ?>
      <hr><a href="https://www.facebook.com/profile.php?id=100009974703784" target="target"><h2>Андрей филипов Луканов</h2></a>
    </body>
</html>